esp8266/Arduino/cores/esp8266/hwdt_app_entry.cpp
/*
 *   Copyright 2020 Michael Hightower
 *
 *   Licensed under the Apache License, Version 2.0 (the "License");
 *   you may not use this file except in compliance with the License.
 *   You may obtain a copy of the License at
 *
 *       http://www.apache.org/licenses/LICENSE-2.0
 *
 *   Unless required by applicable law or agreed to in writing, software
 *   distributed under the License is distributed on an "AS IS" BASIS,
 *   WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *   See the License for the specific language governing permissions and
 *   limitations under the License.
 */

/*
 * As far as I know, there is no way to get called for a Hardware WDT. I assume
 * it generates a form of reset that occurs at a low level that cannot be
 * trapped. Debugging an HWDT can be quite challenging.
 *
 * This module writes a stack dump to the serial port after a Hardware Watchdog
 * Timer has struck, and a new boot cycle has begun. By making adjustments to the
 * stack, we can avoid crash stack data being overwritten by this tool,
 * the Boot ROM, and the bootloader.
 *
 * We are using the method defined for `core_esp8266_app_entry_noextra4k.cpp` to
 * load an alternate `app_entry_redefinable()`. For details on this method, see
 * comments in `core_esp8266_main.cpp's app_entry()`.
 *
 * Using this tool's alternate `app_entry_redefinable()`, we can gain control
 * before the SDK is started. And dump the contents of the "sys" and "cont"
 * stacks.
 *
 * By making some adjustments to start of the stack pointer, at the entry to
 * `app_entry_redefinable()`, and also to the stack pointer passed to the SDK,
 * we can preserve the stack during an HWDT event.
 *
 * To use this tool, select HWDT or HWDT_NO4KEXTRA from the Arduino IDE menu
 * "Tools->Debug Level" before building your sketch. Note, 'Tools->Debug port'
 * selection is not needed or referenced for printing the HWDT stack dump.
 * To enable in other build environments, add DEBUG_ESP_HWDT_NO4KEXTRA or
 * DEBUG_ESP_HWDT global defines to your build.
 *
 * This tool prints to the serial port at the default serial port speed set by
 * the Boot ROM. On a Hardware WDT reset that port speed is 115200 bps. If your
 * needs differ, see the DEBUG_ESP_HWDT_UART_SPEED option below.
 *
 * More on crystal differences and data rates:
 *     When the ESP8266 restarts because of a Hardware WDT reset, the port speed
 *     defaults to 115200. This will be the speed, even if you have a 26MHz or
 *     40MHz Crystal. If you would like to use a different data rate, use the
 *     option DEBUG_ESP_HWDT_UART_SPEED described below.
 *
 *     The Boot ROM initially sets the UART clock divisor to support a data rate
 *     of 115200 bps with the assumption that it has a 40MHz crystal. When a
 *     26MHz crystal is used instead, the resulting error gives us a real rate
 *     of 74880 bps and printing is garbled at first, until the CPU clock's PLL
 *     is adjusted by the NONOS SDK. While CH_PD and EST_RST bring the CPU back
 *     to this state of underclocking with a 26MHz crystal, the Hardware WDT
 *     reset does not appear to do the same. The UART continues to be clocked at
 *     a rate to support a device at 115200 bps. Thus, allowing us to see the
 *     old cryptic WDT message along with our new stack dump.
 *
 *
 * When you get a stack dump, copy-paste it into the "ESP Exception Decoder".
 * Since we don't have an SP, we see a lot more stuff in the report, compared to
 * what you would see with a postmortem report. Start at the bottom and work
 * your way up. At this time, I have not had a lot of practice using this tool.
 * TODO: Update description with more details when available.
 *
 *
 *
 * Possible Issues/Thoughts/Improvements:
 *
 * On reboot after an OTA download, eboot requires a lot of stack and DRAM
 * space. For routine loads from flash, the stack and DRAM usage are small,
 * leaving us valid data to print a stack dump.
 *
 * If a problem should arise with some data elements being corrupted during
 * reboot, would it be possible to move their DRAM location higher in memory?
 *
 * Also, DRAM being valid across reset events other than power-on and deep
 * sleep, suggest that a variable in the .noinit section could be used instead
 * of the more limited RTC Memory for sketches that don't do deep sleep.
 * However, DRAM should be considered invalid after an upload serial or OTA.
 * These operations use a lot of DRAM.
 *
 * With this module active, postmortem stack dumps will be a little longer than
 * they need to be. The sys stack now ends at 0x3FFFFC00 instead of 0x3FFFFB0.
 *
 * Maybe an in/out ref count would be nice for bearssl and cont stacks.
 */

/*____________________________________________________________________________*/
/*                                                                            */
/*                          Configuration Options                             */
/*____________________________________________________________________________*/


/*
 * DEBUG_ESP_HWDT
 *
 * Enables this debug tool for printing a Hardware WDT stack dump at restart.
 *
 * This option is now managed from the Arduinoo IDE menu 'Tools->Debug Level'
 #define DEBUG_ESP_HWDT
 */


/*
 * DEBUG_ESP_HWDT_NO4KEXTRA
 *
 * This option will leave more of the system stack available for the stack dump.
 * A problem we have with the "4K extra" option, is it pushes the system stack
 * up into the ROM's BSS area which gets zeroed at reboot by the Boot ROM.
 *
 * Using this option has the effect of taking 4K of DRAM away from the heap,
 * which gets used for the "cont" stack. Leaving an extra 4K on the "sys" stack,
 * that is clear of the ROM's BSS area. This allows for a more complete "sys"
 * stack dump. The choice here can depend on where you are crashing.
 *
 * Because we don't know where the crash occurs, this option prints two stack
 * dumps, one for "cont" (user stack) and one for "sys" (NONOS SDK).
 *
 * In contrast, if the hang is happening on the "cont" stack, you don't need a
 * complete stack dump of the "sys" stack. You can omit this define and have an
 * extra 4K in the heap.
 *
 * This option is now managed from the Arduinoo IDE menu 'Tools->Debug Level'
 #define DEBUG_ESP_HWDT_NO4KEXTRA
 */


