esp8266/Arduino/cores/esp8266/hwdt_app_entry.cpp
/*
 * If you are using the hwdt_info_t structure, and are missing the include file.
 * Copy-paste the include block below into its respective filename.
 */

/*____________________________________________________________________________*/
/*                                                                            */
/*        Start of copy-paste block to create "hwdt_app_entry.h"              */
/*____________________________________________________________________________*/
#if !defined(HWDT_STACK_DUMP_H) || defined(HWDT_VERIFY_HWDT_INFO)
#define HWDT_STACK_DUMP_H

typedef struct hwdt_info_ {
    uint32_t rom;
    uint32_t sys;
    uint32_t cont;
    uint32_t bearssl;
    uint32_t rom_api_reason;
    uint32_t rtc_sys_reason;
    uint32_t reset_reason;
    uint32_t cont_integrity;
    bool g_pcont_valid;
} hwdt_info_t;

void enable_debug_hwdt_at_link_time(void);
extern "C" void debug_hwdt_init(void);

extern uint32_t *g_rom_stack;
extern hwdt_info_t hwdt_info;

#endif
/*____________________________________________________________________________*/
/*                                                                            */
/*        End of copy-paste block for creating "hwdt_app_entry.h"             */
/*____________________________________________________________________________*/


#ifdef HWDT_VERIFY_HWDT_INFO
#undef hwdt_info_t
#undef hwdt_info_
#undef hwdt_info
#undef HWDT_VERIFY_HWDT_INFO
static_assert(sizeof(hwdt_info_t) == sizeof(LOCAL_HWDT_INFO_T), "Local and include verison of hwdt_info_t do not match.");
#endif


#define MK_ALIGN16_SZ(a) (((a) + 0x0FUL) & ~0x0FUL)
#define ALIGN_UP(a, s) ((decltype(a))((((uintptr_t)(a)) + (s-1)) & ~(s-1)))
#define ALIGN_DOWN(a, s) ((decltype(a))(((uintptr_t)(a)) & ~(s-1)))

#ifndef CONT_STACKGUARD
#define CONT_STACKGUARD 0xfeefeffe
#endif
#define RTC_SYS         ((volatile uint32_t*)0x60001100UL)

/*
 *
 #define DRAM_START      ((uint32_t *)0x3FFE8000UL)
 #define DRAM_END        ((uint32_t *)0x40000000UL)
 *
 * The space between 0x3fffe000 up to 0x3fffeb30 is a ROM BSS area that is later
 * claimed by the SDK for stack space. This is a problem area for this tool,
 * because the ROM BSS gets zeroed as part of ROM init on reboot. Any part of
 * the "sys" stack residing there is lost. On the other hand, it becomes a prime
 * candidate for DRAM address space to handle the needs of this tool.
 *
 #define SYS_STACK_E000     ((uint32_t *)0x3fffe000UL)
 */

#define ROM_STACK_FIRST ((uint32_t *)0x40000000UL)
#define SYS_STACK       ((uint32_t *)0x3fffeb30UL)

// Map out who will live where.
#define ROM_STACK_A16_SZ   (MK_ALIGN16_SZ(DEBUG_ESP_HWDT_ROM_STACK_SIZE))
#define CONT_STACK_A16_SZ  (MK_ALIGN16_SZ(sizeof(cont_t)))
#define ROM_STACK ((uint32_t *) ((uintptr_t)ROM_STACK_FIRST - ROM_STACK_A16_SZ))


#ifdef DEBUG_ESP_HWDT_NO4KEXTRA
/* This is the default NONOS-SDK user's heap location for NO4KEXTRA */
#define SYS_STACK_FIRST ROM_STACK
extern cont_t * get_g_cont(void);

#else
#define CONT_STACK_FIRST ROM_STACK // only for computation
#define CONT_STACK ((cont_t *)((uintptr_t)CONT_STACK_FIRST - CONT_STACK_A16_SZ))
#define SYS_STACK_FIRST CONT_STACK
#endif

uint32_t *g_rom_stack  __attribute__((section(".noinit")));
size_t g_rom_stack_A16_sz  __attribute__((section(".noinit")));
hwdt_info_t hwdt_info __attribute__((section(".noinit")));

extern "C" {

#if USE_IRAM
#define ETS_PRINTF ets_uart_printf

#else
/*
 This function is already in umm_malloc for some debug options.
 Define here in case they are not enabled.
*/
int ICACHE_FLASH_ATTR umm_info_safe_printf_P(const char *fmt, ...) __attribute__((weak));
int ICACHE_FLASH_ATTR umm_info_safe_printf_P(const char *fmt, ...) {
    /*
      To use ets_strlen() and ets_strcpy() safely with PROGMEM, flash storage,
      the PROGMEM address must be word (4 bytes) aligned. The destination
      address for ets_memcpy must also be word-aligned.
    */
    char ram_buf[ets_strlen(fmt) + 1] __attribute__((aligned(4)));
    ets_strcpy(ram_buf, fmt);
    va_list argPtr;
    va_start(argPtr, fmt);
    int result = ets_vprintf(ets_uart_putc1, ram_buf, argPtr);
    va_end(argPtr);
    return result;
}

#define ETS_PRINTF(fmt, ...) umm_info_safe_printf_P(PSTR(fmt), ##__VA_ARGS__)
#endif

#define ETS_FLUSH(uart_no) while((USS(uart_no) >> USTXC) & 0xff) {}

enum PRINT_STACK {
    CONT = 1,
    SYS = 2,
    ROM = 4,
    BEARSSL = 8
};


STATIC void IRAM_MAYBE print_stack(const uintptr_t start, const uintptr_t end, const uint32_t chunk) {
    ETS_PRINTF("\n\n>>>stack>>>\n\nctx: ");

    if (chunk & PRINT_STACK::CONT) {
        ETS_PRINTF("cont");
    } else
    if (chunk & PRINT_STACK::SYS) {
        ETS_PRINTF("sys");
    } else
    if (chunk & PRINT_STACK::ROM) {
        ETS_PRINTF("ROM");
    } else
    if (chunk & PRINT_STACK::BEARSSL) {
        ETS_PRINTF("bearssl");
    }

    ETS_PRINTF("\nsp: %08x end: %08x offset: %04x\n", start, end, 0);

    const size_t this_mutch = end - start;
    if (this_mutch >= 0x10) {
        for (size_t pos = 0; pos < this_mutch; pos += 0x10) {
            const uint32_t *value = (uint32_t *)(start + pos);

            /* rough indicator: stack frames usually have SP saved as the second word */
            bool looksLikeStackFrame = (value[2] == (start + pos + 0x10));
            ETS_PRINTF("%08x:  %08x %08x %08x %08x %c\n", (uint32_t)&value[0],
                       value[0], value[1], value[2], value[3],
                       (looksLikeStackFrame)?'<':' ');
        }
    }

    ETS_PRINTF("<<<stack<<<\n");
}


STATIC const uint32_t * IRAM_MAYBE skip_stackguard(const uint32_t *start, const uint32_t *end, const uint32_t pattern) {
    // Find the end of SYS stack activity
    const uint32_t *uptr = start;

    size_t this_mutch = (uintptr_t)end - (uintptr_t)start;
    this_mutch /= sizeof(uint32_t);
    size_t i = 0;
    for (; i < this_mutch; i++) {
        if (pattern != uptr[i]) {
            i &= ~3U;
            uptr = &uptr[i];
            break;
        }
    }
    if (i == this_mutch) {
        uptr = &uptr[i];
    }

    return uptr;
}

STATIC void IRAM_MAYBE check_g_pcont_validity(void) {
    /*
     * DRAM appears to remain valid after most resets. There is more on this in
     * handle_hwdt().
     *
     * Testing of vital pointers for validity could also aid as a partial
     * indicator of power-on. Not needed for that purpose at this time.
     */
    if (g_rom_stack == ROM_STACK &&
        g_rom_stack_A16_sz == ROM_STACK_A16_SZ &&
#ifdef DEBUG_ESP_HWDT_NO4KEXTRA
        g_pcont == get_g_cont()
#else
        g_pcont == CONT_STACK
#endif
        ) {
            hwdt_info.g_pcont_valid = true;
    } else {
        hwdt_info.g_pcont_valid = false;
        g_rom_stack = ROM_STACK;
        g_rom_stack_A16_sz = ROM_STACK_A16_SZ;
    }
}

