esp8266/Arduino/cores/esp8266/hwdt_app_entry.cpp
    /*
     *  Fill the SDK stack area with CONT_STACKGUARD so we can detect and
     *  skip the unused section of the stack when printing a Stack Dump.
     */
    {
        size_t this_mutch = (uintptr_t)ROM_STACK - (uintptr_t)SYS_STACK;
        this_mutch /= sizeof(uint32_t);
        for (size_t i = 0; i < this_mutch; i++) {
            SYS_STACK[i] = CONT_STACKGUARD;
        }
    }

#if defined(DEBUG_ESP_HWDT_INFO) || defined(ROM_STACK_DUMP)
    /*
     *  Reports on ROM_STACK usage by ROM and eboot.
     *  Used to confirm DEBUG_ESP_HWDT_ROM_STACK_SIZE is large enough.
     */
    {
        const uint32_t *ctx_rom_ptr = skip_stackguard(ROM_STACK, ROM_STACK_FIRST, CONT_STACKGUARD);
        hwdt_info.rom = (uintptr_t)ROM_STACK_FIRST - (uintptr_t)ctx_rom_ptr;
#if defined(ROM_STACK_DUMP)
        print_stack((uintptr_t)ctx_rom_ptr, (uintptr_t)ROM_STACK_FIRST, PRINT_STACK::ROM);
#endif
    }
#endif

#if defined(DEBUG_ESP_HWDT_PRINT_GREETING)
    ETS_PRINTF("\n\nHardware WDT Stack Dump - enabled\n\n");
#else
    ETS_PRINTF("\n\n");
#endif

#ifdef DEBUG_ESP_HWDT_UART_SPEED
    if (uart_divisor) {
        adjust_uart_speed(uart_divisor);
    }
#endif
}

/*
 * Using Cache_Read_Enable/Cache_Read_Disable to reduce IRAM usage. Moved
 * strings and most functions to flash. At this phase of the startup, "C++" has
 * not initialized. So, we needed a local "C" function to handle printing from
 * flash. For this, I grabbed a copy of umm_info_safe_printf_P.
 *
 * This reduced IRAM usage by ~1K and DRAM ~200 bytes.
 *
 * Inspiration for using Cache_Read_Enable came from reviewing rboot, zboot, and
 * https://richard.burtons.org/2015/06/12/esp8266-cache_read_enable/.
 * Additional insight can be gleemed from reviewing the ESP8266_RTOS_SDK.
 * (eg. ../components/bootloader_support/src/bootloader_utility.c)
 */
#define ICACHE_SIZE_32 1
#define ICACHE_SIZE_16 0

extern "C" void Cache_Read_Disable(void);
extern "C" void Cache_Read_Enable(uint8_t map, uint8_t p, uint8_t v);

#ifndef USE_IRAM
static void ICACHE_RAM_ATTR __attribute__((noinline)) handle_hwdt_icache() {
  Cache_Read_Enable(0, 0, ICACHE_SIZE_16);
  handle_hwdt();
  Cache_Read_Disable();
}
#endif

void ICACHE_RAM_ATTR app_entry_start(void) {

#ifdef USE_IRAM
    handle_hwdt();
#else
    handle_hwdt_icache();
#endif

#ifdef DEBUG_ESP_HWDT_NO4KEXTRA
    /*
     *  Continuation context is in BSS.
     */
    g_pcont = get_g_cont();
#else
    /*
     *  The continuation context is on the stack just after the reserved space
     *  for the ROM/eboot stack and before the SYS stack begins.
     *  All computations were done at top, save pointer to it now.
     */
    g_pcont = CONT_STACK;
#endif
    /*
     *  Use new calculated SYS stack from top.
     *  Call the entry point of the SDK code.
     */
    asm volatile ("mov.n a1, %0\n\t"
                  "movi a0, 0x4000044c\n\t"     /* Should never return; however, set return to Boot ROM Breakpoint */
                  "jx %1\n\t" ::
                  "r" (SYS_STACK_FIRST), "r" (call_user_start):
                  "a0", "memory");

    __builtin_unreachable();
}

void ICACHE_RAM_ATTR app_entry_redefinable(void) {
    /*
     * There are 4 sections of code that share the stack starting near
     * 0x40000000.
     *   1) The Boot ROM (uses around 640 bytes)
     *   2) The Bootloader, eboot.elf (last seen using 720 bytes.)
     *   3) `app_entry_redefinable()` just before it starts the SDK.
     *   4) The NONOS SDK, optionally the Core when the extra 4K option is
     *      selected.
     *
     * Use the ROM BSS zeroed out memory as the home for our temporary stack.
     * This way no additional information will be lost. That will remove this
     * tool from the list of possible concerns for stack overwrite.
     *
     */

    asm volatile ("movi a1, 0x3fffeb30\n\t"
                  "j app_entry_start" ::: "memory");

    /*
     * Keep this function with just asm seems to help avoid a stack frame being
     * created for this function and things getting really confused.
     */

    __builtin_unreachable();
}

#if defined(DEBUG_ESP_HWDT_INFO) || defined(ROM_STACK_DUMP)
void debug_hwdt_init(void) {
    /*
     * Fill the ROM_STACK while it is not actively being used.
     *
     * I am thinking that during the time the sketch is running this block of
     * memory could be used for a scratch buffer.
     */
    for (size_t i = 0; i < g_rom_stack_A16_sz/sizeof(uint32_t); i++) {
        g_rom_stack[i] = CONT_STACKGUARD;
    }
}
#else
void debug_hwdt_init(void) {
}
#endif

};

#endif // end of #if defined(DEBUG_ESP_HWDT) || defined(DEBUG_ESP_HWDT_NO4KEXTRA)
